{
  "irVersion": "1.0",
  "project": "gocharts",
  "repository": "https://github.com/grokify/gocharts",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v2.27.0",
      "date": "2026-03-16",
      "highlights": [
        {
          "description": "New `chartir` package providing a non-polymorphic intermediate representation for charts, compilable to ECharts, PNG/SVG, and other formats"
        }
      ],
      "added": [
        {
          "description": "`charts/chartir` package with ChartIR types: datasets, marks, axes, legend, tooltip, grid",
          "commit": "2ad92fc"
        },
        {
          "description": "`charts/chartir/wchart` compiler for PNG/SVG output via go-analyze/charts",
          "commit": "2ad92fc"
        },
        {
          "description": "11 geometry types: line, bar, pie, scatter, area, radar, funnel, gauge, heatmap, treemap, sankey",
          "commit": "2ad92fc"
        },
        {
          "description": "Typed constants for axis types, positions, column types, and tooltip triggers",
          "commit": "2ad92fc"
        }
      ],
      "fixed": [
        {
          "description": "Resolve gosec lint warnings (G703, G706, G115) with nolint directives and structured logging",
          "commit": "e644f52"
        }
      ],
      "security": [
        {
          "description": "Add permissions to workflow to fix code scanning alert",
          "commit": "0979654"
        }
      ],
      "documentation": [
        {
          "description": "Expand README with features, quick start examples, and output formats table",
          "commit": "372daca"
        },
        {
          "description": "Update README shields and badges",
          "commit": "5339ec5"
        }
      ],
      "dependencies": [
        {
          "description": "Bump github.com/go-echarts/go-echarts/v2 from 2.6.7 to 2.7.0",
          "commit": "cbf8477"
        },
        {
          "description": "Bump github.com/go-analyze/charts from 0.5.24 to 0.5.26",
          "commit": "b3e42f1"
        },
        {
          "description": "Bump github.com/grokify/mogo from 0.73.1 to 0.73.4",
          "commit": "39d9d6b"
        },
        {
          "description": "Bump github.com/xuri/excelize/v2 from 2.10.0 to 2.10.1",
          "commit": "2d72d20"
        },
        {
          "description": "Bump github.com/nao1215/markdown from 0.10.0 to 0.13.0",
          "commit": "50052b2"
        },
        {
          "description": "Bump github.com/olekukonko/tablewriter from 1.1.3 to 1.1.4",
          "commit": "dfb56f0"
        }
      ],
      "internal": [
        {
          "description": "Move CI workflows to shared workflows",
          "commit": "168574c"
        },
        {
          "description": "Rename workflow files for specificity",
          "commit": "8f8bb4f"
        },
        {
          "description": "Update branch references from master to main",
          "commit": "5645a3c"
        },
        {
          "description": "Update copyright year in LICENSE",
          "commit": "7b2bb82"
        }
      ]
    },
    {
      "version": "v2.26.9",
      "date": "2026-02-14",
      "dependencies": [
        {
          "description": "Merge pull request #126 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.73.0",
          "issue": "126",
          "commit": "009d572"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.72.7 to 0.73.0",
          "commit": "2e3d4a3"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update dependencies",
          "commit": "a35aab0"
        }
      ]
    },
    {
      "version": "v2.26.8",
      "date": "2026-01-30",
      "dependencies": [
        {
          "description": "Merge pull request #125 from grokify/dependabot/go_modules/github.com/go-analyze/charts-0.5.24",
          "issue": "125",
          "commit": "5e590ff"
        },
        {
          "description": "Merge pull request #124 from grokify/dependabot/go_modules/github.com/go-analyze/charts-0.5.23",
          "issue": "124",
          "commit": "7e30c7a"
        },
        {
          "description": "Merge pull request #123 from grokify/dependabot/go_modules/github.com/olekukonko/tablewriter-1.1.3",
          "issue": "123",
          "commit": "58a345c"
        },
        {
          "description": "Merge pull request #122 from grokify/dependabot/go_modules/gonum.org/v1/gonum-0.17.0",
          "issue": "122",
          "commit": "1a9bef0"
        },
        {
          "description": "Merge pull request #121 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.72.6",
          "issue": "121",
          "commit": "e8687df"
        },
        {
          "description": "Merge pull request #120 from grokify/dependabot/go_modules/github.com/go-analyze/charts-0.5.22",
          "issue": "120",
          "commit": "8d6e1f9"
        },
        {
          "description": "Merge pull request #119 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.72.5",
          "issue": "119",
          "commit": "746e3ac"
        }
      ],
      "build": [
        {
          "description": "bump github.com/go-analyze/charts from 0.5.23 to 0.5.24",
          "commit": "efab273"
        },
        {
          "description": "bump github.com/go-analyze/charts from 0.5.22 to 0.5.23",
          "commit": "1f049c3"
        },
        {
          "description": "bump github.com/olekukonko/tablewriter from 1.1.2 to 1.1.3",
          "commit": "68c06f4"
        },
        {
          "description": "bump gonum.org/v1/gonum from 0.16.0 to 0.17.0",
          "commit": "e892384"
        },
        {
          "description": "bump github.com/grokify/mogo from 0.72.5 to 0.72.6",
          "commit": "9ecf352"
        },
        {
          "description": "bump github.com/go-analyze/charts from 0.5.21 to 0.5.22",
          "commit": "ecf7e76"
        },
        {
          "description": "bump github.com/grokify/mogo from 0.72.3 to 0.72.5",
          "commit": "5f2d3fd"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update dependencies",
          "commit": "b57f780"
        },
        {
          "description": "`go mod`: update dependencies",
          "commit": "198cbbb"
        }
      ]
    },
    {
      "version": "v2.26.7",
      "date": "2025-12-12",
      "dependencies": [
        {
          "description": "Merge pull request #118 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.72.2",
          "issue": "118",
          "commit": "76ead06"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.72.0 to 0.72.2",
          "commit": "d3c6383"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "db1272e"
        }
      ]
    },
    {
      "version": "v2.26.6",
      "date": "2025-11-30",
      "dependencies": [
        {
          "description": "Merge pull request #117 from grokify/dependabot/go_modules/github.com/nao1215/markdown-0.10.0",
          "issue": "117",
          "commit": "baa20ef"
        }
      ],
      "build": [
        {
          "description": "bump github.com/nao1215/markdown from 0.8.3 to 0.10.0",
          "commit": "fdd90dc"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "4e5028c"
        },
        {
          "description": "`go mod`: update",
          "commit": "a13ffe8"
        }
      ]
    },
    {
      "version": "v2.26.5",
      "date": "2025-11-22",
      "added": [
        {
          "description": "`charts/text/progressbarchart`: add `ChartsTextFromHistogram()`, `Tasks.CurrentCountMax()`, `Tasks.SetMaxCountsMax()`",
          "commit": "f830a7f"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #115 from grokify/dependabot/github_actions/actions/checkout-6",
          "issue": "115",
          "commit": "b56e694"
        },
        {
          "description": "Merge pull request #114 from grokify/dependabot/go_modules/golang.org/x/crypto-0.45.0",
          "issue": "114",
          "commit": "1467120"
        },
        {
          "description": "Merge pull request #113 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.71.9",
          "issue": "113",
          "commit": "ffa6eec"
        }
      ],
      "build": [
        {
          "description": "bump actions/checkout from 5 to 6",
          "commit": "893d6e1"
        },
        {
          "description": "bump golang.org/x/crypto from 0.44.0 to 0.45.0",
          "commit": "df36aff"
        },
        {
          "description": "bump github.com/grokify/mogo from 0.71.8 to 0.71.9",
          "commit": "5d668a2"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "c62f8fd"
        },
        {
          "description": "`go mod`: update",
          "commit": "f9dc8d1"
        }
      ]
    },
    {
      "version": "v2.26.4",
      "date": "2025-11-12",
      "added": [
        {
          "description": "`charts/text/progressbarchart`: add initial implementation for text-based charts",
          "commit": "0b3e118"
        }
      ]
    },
    {
      "version": "v2.26.3",
      "date": "2025-11-12",
      "added": [
        {
          "description": "`data/histogram`: add `Histogram.ItemNamesOrderOrDefault()`",
          "commit": "b090213"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #112 from grokify/dependabot/go_modules/github.com/olekukonko/tablewriter-1.1.1",
          "issue": "112",
          "commit": "1970a3a"
        },
        {
          "description": "Merge pull request #111 from grokify/dependabot/github_actions/golangci/golangci-lint-action-9",
          "issue": "111",
          "commit": "ca571bd"
        }
      ],
      "build": [
        {
          "description": "bump github.com/olekukonko/tablewriter from 1.1.0 to 1.1.1",
          "commit": "00da127"
        },
        {
          "description": "bump golangci/golangci-lint-action from 8 to 9",
          "commit": "ae1371a"
        }
      ]
    },
    {
      "version": "v2.26.2",
      "date": "2025-11-10",
      "added": [
        {
          "description": "`data/table`: add `ReadTableXLSXIndex()`",
          "commit": "92d17b6"
        },
        {
          "description": "`data/table`: add `Table.FilterNonEmptyRows()`",
          "commit": "b2eca97"
        },
        {
          "description": "`data/table`: ad `FormatPercent`",
          "commit": "5e27b32"
        }
      ],
      "changed": [
        {
          "description": "`data/table`: add `Table.FormatterFunc()` add `FormatPercent` support",
          "commit": "48a4384"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #110 from grokify/dependabot/go_modules/github.com/go-echarts/go-echarts/v2-2.6.6",
          "issue": "110",
          "commit": "48131e3"
        }
      ],
      "build": [
        {
          "description": "bump github.com/go-echarts/go-echarts/v2",
          "commit": "8ecde8b"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "b445531"
        }
      ]
    },
    {
      "version": "v2.26.1",
      "date": "2025-10-29",
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "97de41d"
        }
      ]
    },
    {
      "version": "v2.26.0",
      "date": "2025-10-19",
      "added": [
        {
          "description": "`data/histogram`: add `HistogramSets.Markdown()`",
          "commit": "2edee5e"
        },
        {
          "description": "`data/histogram`: add `HistogramSets.Order`, `HistogramSets.UpdateSetOrders()`",
          "commit": "d1aa2d6"
        }
      ],
      "changed": [
        {
          "description": "`charts`|`data`: update to consistent `Items` attribute",
          "commit": "a64fa3b"
        },
        {
          "description": "`data/histogram`: update to consistent `Items` attribute",
          "commit": "1ea88d1"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #108 from grokify/dependabot/go_modules/github.com/go-echarts/go-echarts/v2-2.6.5",
          "issue": "108",
          "commit": "9cd877b"
        },
        {
          "description": "Merge pull request #107 from grokify/dependabot/go_modules/github.com/xuri/excelize/v2-2.10.0",
          "issue": "107",
          "commit": "f6447a8"
        }
      ],
      "build": [
        {
          "description": "bump github.com/go-echarts/go-echarts/v2",
          "commit": "f9a9e13"
        },
        {
          "description": "bump github.com/xuri/excelize/v2 from 2.9.1 to 2.10.0",
          "commit": "9edf6b4"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "6c8f24c"
        }
      ]
    },
    {
      "version": "v2.25.5",
      "date": "2025-10-12",
      "fixed": [
        {
          "description": "`data/table`: fix consistent line widths in `Table.Markdown()`",
          "commit": "e80c5db"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "ca0af17"
        },
        {
          "description": "`go mod`: update",
          "commit": "987f5a2"
        }
      ]
    },
    {
      "version": "v2.25.4",
      "date": "2025-09-29",
      "internal": [
        {
          "description": "`go mod`: update dependencies",
          "commit": "c789879"
        }
      ]
    },
    {
      "version": "v2.25.3",
      "date": "2025-09-28",
      "changed": [
        {
          "description": "`data/histogram`: use `MatchType`",
          "commit": "aca3cc7"
        }
      ]
    },
    {
      "version": "v2.25.2",
      "date": "2025-09-28",
      "dependencies": [
        {
          "description": "Merge pull request #103 from grokify/dependabot/github_actions/actions/setup-go-6",
          "issue": "103",
          "commit": "74b3b8c"
        },
        {
          "description": "Merge pull request #106 from grokify/dependabot/go_modules/github.com/olekukonko/tablewriter-1.1.0",
          "issue": "106",
          "commit": "0da1415"
        }
      ],
      "build": [
        {
          "description": "bump github.com/olekukonko/tablewriter from 1.0.9 to 1.1.0",
          "commit": "85a4c8e"
        },
        {
          "description": "bump actions/setup-go from 5 to 6",
          "commit": "553e810"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "05c8518"
        },
        {
          "description": "`go build`: update go versions",
          "commit": "476ad87"
        }
      ]
    },
    {
      "version": "v2.25.1",
      "date": "2025-09-14",
      "security": [
        {
          "description": "Potential fix for code scanning alert no. 3: Workflow does not contain permissions",
          "commit": "2d16baf"
        }
      ],
      "fixed": [
        {
          "description": "Merge pull request #105 from grokify/alert-autofix-3",
          "issue": "105",
          "commit": "8851063"
        }
      ]
    },
    {
      "version": "v2.25.0",
      "date": "2025-09-14",
      "added": [
        {
          "description": "`data/histogram`: add `HistogramSet.TransformBinNamesMapSlice()`",
          "commit": "9d4c882"
        },
        {
          "description": "`data/histogram`: add `HistogramSet.AddHistogramBulk()`",
          "commit": "ef09b85"
        },
        {
          "description": "`data/histogram`: add `Histogram.TransformBinNamesMapSlice()`",
          "commit": "b304338"
        },
        {
          "description": "`charts/google/columnchart`: add",
          "commit": "91c4fc0"
        },
        {
          "description": "`charts/google`: add `DataTableFromHistogramSet()`",
          "commit": "65f8224"
        }
      ],
      "changed": [
        {
          "description": "Merge pull request #104 from jentfoo/wcharczuk-chart-switch",
          "issue": "104",
          "commit": "3660893"
        },
        {
          "description": "go mod tidy",
          "commit": "42ad62c"
        },
        {
          "description": "Switch from wcharczuk/go-chart to go-analyze/charts",
          "commit": "fe53034"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "8e523d6"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "177824d"
        }
      ]
    },
    {
      "version": "v2.24.20",
      "date": "2025-09-07",
      "dependencies": [
        {
          "description": "Merge pull request #100 from grokify/dependabot/go_modules/github.com/nao1215/markdown-0.8.1",
          "issue": "100",
          "commit": "be3d9b1"
        },
        {
          "description": "Merge pull request #102 from grokify/dependabot/go_modules/github.com/go-echarts/go-echarts/v2-2.6.2",
          "issue": "102",
          "commit": "371ae47"
        }
      ],
      "build": [
        {
          "description": "bump github.com/go-echarts/go-echarts/v2",
          "commit": "1c3a631"
        },
        {
          "description": "bump github.com/nao1215/markdown from 0.8.0 to 0.8.1",
          "commit": "60200c3"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "b284231"
        }
      ]
    },
    {
      "version": "v2.24.19",
      "date": "2025-08-27",
      "dependencies": [
        {
          "description": "Merge pull request #99 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.70.19",
          "issue": "99",
          "commit": "82f43a5"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.70.18 to 0.70.19",
          "commit": "d564604"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "eef997c"
        }
      ]
    },
    {
      "version": "v2.24.18",
      "date": "2025-08-25",
      "added": [
        {
          "description": "`data/table`: add `FormatMap{}`",
          "commit": "8742790"
        },
        {
          "description": "`data/table`: add `Table.RowMapAny()`",
          "commit": "7c03af1"
        },
        {
          "description": "`data/table`: add `Columns.RowMapAny()`",
          "commit": "d187a35"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #98 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.70.17",
          "issue": "98",
          "commit": "81856b2"
        },
        {
          "description": "Merge pull request #97 from grokify/dependabot/github_actions/actions/checkout-5",
          "issue": "97",
          "commit": "4d4de77"
        },
        {
          "description": "Merge pull request #96 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.70.16",
          "issue": "96",
          "commit": "d6677a0"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.70.16 to 0.70.17",
          "commit": "3d91a5e"
        },
        {
          "description": "bump actions/checkout from 4 to 5",
          "commit": "4080b00"
        },
        {
          "description": "bump github.com/grokify/mogo from 0.70.15 to 0.70.16",
          "commit": "0b12f4d"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "04901c7"
        },
        {
          "description": "`ci`: update go versions",
          "commit": "137ebc0"
        }
      ]
    },
    {
      "version": "v2.24.17",
      "date": "2025-08-03",
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "66018c7"
        }
      ]
    },
    {
      "version": "v2.24.16",
      "date": "2025-08-03",
      "added": [
        {
          "description": "`data/table`: add `Table.ColumnsValues()`",
          "commit": "6e8583c"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #95 from grokify/dependabot/go_modules/github.com/olekukonko/tablewriter-1.0.9",
          "issue": "95",
          "commit": "01e69be"
        }
      ],
      "build": [
        {
          "description": "bump github.com/olekukonko/tablewriter from 1.0.8 to 1.0.9",
          "commit": "6892f23"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "c22c884"
        }
      ]
    },
    {
      "version": "v2.24.15",
      "date": "2025-07-19",
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "437f436"
        }
      ]
    },
    {
      "version": "v2.24.14",
      "date": "2025-07-18",
      "fixed": [
        {
          "description": "`data/table`: update `Table.FormatterFunc()` to use `time.DateOnly` for `FormatDate`",
          "commit": "f3f5082"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #93 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.70.12",
          "issue": "93",
          "commit": "5d5b04a"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.70.11 to 0.70.12",
          "commit": "1495ae5"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "b49e5dd"
        }
      ]
    },
    {
      "version": "v2.24.13",
      "date": "2025-07-13",
      "added": [
        {
          "description": "`data/erd`: add supported constants for `TypeDecimal` and `TypeTimestamp`",
          "commit": "4e5f8b0"
        }
      ],
      "changed": [
        {
          "description": "`data/table`: update `Columns.CellStringByLetters()` error message",
          "commit": "8557d06"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #92 from grokify/dependabot/go_modules/github.com/olekukonko/tablewriter-1.0.8",
          "issue": "92",
          "commit": "a86ac28"
        },
        {
          "description": "Merge pull request #91 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.70.10",
          "issue": "91",
          "commit": "e8efe45"
        }
      ],
      "documentation": [
        {
          "description": "`data/erd`: add README",
          "commit": "ee75113"
        }
      ],
      "build": [
        {
          "description": "bump github.com/olekukonko/tablewriter from 1.0.7 to 1.0.8",
          "commit": "e98acd0"
        },
        {
          "description": "bump github.com/grokify/mogo from 0.70.9 to 0.70.10",
          "commit": "167ef8a"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "2b65442"
        }
      ]
    },
    {
      "version": "v2.24.12",
      "date": "2025-06-22",
      "added": [
        {
          "description": "`data/erd`: add `Relationship{}`, `Relationships{}`",
          "commit": "6261009"
        },
        {
          "description": "`data/table`: add `TableSet.ColumnSetByTableName()`",
          "commit": "cba2743"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #90 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.70.8",
          "issue": "90",
          "commit": "9e3ff6c"
        },
        {
          "description": "Merge pull request #88 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.70.6",
          "issue": "88",
          "commit": "6f2c7da"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.70.7 to 0.70.8",
          "commit": "3918aee"
        },
        {
          "description": "bump github.com/grokify/mogo from 0.70.5 to 0.70.6",
          "commit": "59ea116"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "f871e4f"
        },
        {
          "description": "`go mod`: update",
          "commit": "d28bed4"
        }
      ]
    },
    {
      "version": "v2.24.11",
      "date": "2025-06-08",
      "dependencies": [
        {
          "description": "Merge pull request #87 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.70.3",
          "issue": "87",
          "commit": "4b20a85"
        }
      ],
      "documentation": [
        {
          "description": "`README.md`: cleanup shields",
          "commit": "3eb70fd"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.70.2 to 0.70.3",
          "commit": "c4d2a35"
        }
      ],
      "internal": [
        {
          "description": "`go.mod`: update",
          "commit": "0b6ca38"
        }
      ]
    },
    {
      "version": "v2.24.10",
      "date": "2025-06-01",
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "5d89ca1"
        }
      ]
    },
    {
      "version": "v2.24.9",
      "date": "2025-06-01",
      "dependencies": [
        {
          "description": "Merge pull request #86 from grokify/dependabot/go_modules/github.com/olekukonko/tablewriter-1.0.7",
          "issue": "86",
          "commit": "4c9828d"
        }
      ],
      "build": [
        {
          "description": "bump github.com/olekukonko/tablewriter from 1.0.6 to 1.0.7",
          "commit": "7c88b56"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "94ae68a"
        },
        {
          "description": "`go mod`: update",
          "commit": "657316a"
        }
      ]
    },
    {
      "version": "v2.24.8",
      "date": "2025-05-18",
      "dependencies": [
        {
          "description": "Merge pull request #83 from grokify/dependabot/go_modules/github.com/xuri/excelize/v2-2.9.1",
          "issue": "83",
          "commit": "23534d3"
        }
      ],
      "build": [
        {
          "description": "bump github.com/xuri/excelize/v2 from 2.9.0 to 2.9.1",
          "commit": "3915045"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "947e266"
        },
        {
          "description": "`go mod`: update",
          "commit": "119db60"
        }
      ]
    },
    {
      "version": "v2.24.7",
      "date": "2025-05-12",
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "c7234aa"
        }
      ]
    },
    {
      "version": "v2.24.6",
      "date": "2025-05-11",
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "f09a313"
        }
      ]
    },
    {
      "version": "v2.24.5",
      "date": "2025-05-11",
      "added": [
        {
          "description": "`data/table`: add `Columns.Clone()`",
          "commit": "1244d43"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #82 from grokify/dependabot/go_modules/github.com/go-echarts/go-echarts/v2-2.5.4",
          "issue": "82",
          "commit": "533aec7"
        }
      ],
      "build": [
        {
          "description": "bump github.com/go-echarts/go-echarts/v2",
          "commit": "f65936d"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "93ba8b5"
        }
      ]
    },
    {
      "version": "v2.24.4",
      "date": "2025-05-08",
      "added": [
        {
          "description": "`data/table/sheet`: add `ColLettersToIndex()`",
          "commit": "37d0143"
        }
      ]
    },
    {
      "version": "v2.24.3",
      "date": "2025-05-08",
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "3dda9c8"
        }
      ]
    },
    {
      "version": "v2.24.2",
      "date": "2025-05-08",
      "added": [
        {
          "description": "`data/table`: add `TableSet.Table()`",
          "commit": "deafebc"
        },
        {
          "description": "`data/table`: add `ReadFileCSV()`",
          "commit": "749858b"
        },
        {
          "description": "`data/table`: add `Columns.CellStringByLetters()`",
          "commit": "13e1333"
        }
      ],
      "changed": [
        {
          "description": "`data/table/sheet`: rename `TestColLettersToNumber()` from `TestColLettersToIndex()`",
          "commit": "573efe0"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #81 from grokify/dependabot/github_actions/golangci/golangci-lint-action-8",
          "issue": "81",
          "commit": "770e6e6"
        }
      ],
      "build": [
        {
          "description": "bump golangci/golangci-lint-action from 7 to 8",
          "commit": "df471db"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "285d570"
        }
      ]
    },
    {
      "version": "v2.24.1",
      "date": "2025-05-03",
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "aa9f3ae"
        }
      ]
    },
    {
      "version": "v2.24.0",
      "date": "2025-05-03",
      "added": [
        {
          "description": "`data/table`: add `Columns.ModifyNamesColLettersMap()` and supporting letters code",
          "commit": "d5b4b50"
        }
      ],
      "changed": [
        {
          "description": "`data/table`: add `OR` filter for `Table.FilterColumnValuesRows()`, `Table.FilterColumnValuesTable()`",
          "commit": "354cffa"
        }
      ],
      "documentation": [
        {
          "description": "`README.md`: add lint shield",
          "commit": "3ca356c"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "cd4a238"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "5d82a2e"
        },
        {
          "description": "`golangic-lint`: fix various",
          "commit": "2b03110"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "86ee2fd"
        }
      ]
    },
    {
      "version": "v2.23.6",
      "date": "2025-04-28",
      "dependencies": [
        {
          "description": "Merge pull request #80 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.68.11",
          "issue": "80",
          "commit": "00f6c2b"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.68.10 to 0.68.11",
          "commit": "21ceda1"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "e5e284e"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "101c0fc"
        }
      ]
    },
    {
      "version": "v2.23.5",
      "date": "2025-04-21",
      "internal": [
        {
          "description": "go mod: update",
          "commit": "cb9fa03"
        }
      ]
    },
    {
      "version": "v2.23.4",
      "date": "2025-04-21",
      "changed": [
        {
          "description": "`data/histogram`: update field names",
          "commit": "4a484aa"
        }
      ],
      "internal": [
        {
          "description": "`golangci-lint`: fix various",
          "commit": "0c875d5"
        }
      ]
    },
    {
      "version": "v2.23.3",
      "date": "2025-04-20",
      "added": [
        {
          "description": "`data/table`: add `Table.Text()`",
          "commit": "d22f8b0"
        }
      ],
      "changed": [
        {
          "description": "`data/histogram`: rename `SetsTablePivotOpts` from `TablePivotOpts`",
          "commit": "b3de274"
        },
        {
          "description": "`data/histogram`: add percent column and row to `HistogramSet.TablePivot()`",
          "commit": "500724c"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #78 from grokify/dependabot/go_modules/github.com/go-echarts/go-echarts/v2-2.5.3",
          "issue": "78",
          "commit": "d10ba6e"
        }
      ],
      "build": [
        {
          "description": "bump github.com/go-echarts/go-echarts/v2",
          "commit": "e6642de"
        }
      ],
      "internal": [
        {
          "description": "`golangci-lint`: fix various",
          "commit": "035733e"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "1e780b7"
        },
        {
          "description": "go mod: update",
          "commit": "402c603"
        },
        {
          "description": "go mod: update",
          "commit": "341f1e9"
        }
      ]
    },
    {
      "version": "v2.23.2",
      "date": "2025-04-08",
      "internal": [
        {
          "description": "go mod: update",
          "commit": "78e7899"
        }
      ]
    },
    {
      "version": "v2.23.1",
      "date": "2025-04-06",
      "added": [
        {
          "description": "`data/histogram`: add `HistogramSets.HistogramSetOneTwo()`, `HistogramSets.HistogramSetOneThree()`",
          "commit": "020e84b"
        }
      ]
    },
    {
      "version": "v2.23.0",
      "date": "2025-04-06",
      "added": [
        {
          "description": "`data/table`: add `Table.ColumnInsert()`",
          "commit": "f8f8eee"
        },
        {
          "description": "`data/histogram`: add `HistogramSet.BinsOrder`, `HistogramSet.HistogramOrder()`",
          "commit": "4626556"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #77 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.68.4",
          "issue": "77",
          "commit": "29a5665"
        },
        {
          "description": "Merge pull request #75 from grokify/dependabot/github_actions/golangci/golangci-lint-action-7",
          "issue": "75",
          "commit": "537ebeb"
        },
        {
          "description": "Merge pull request #76 from grokify/dependabot/go_modules/gonum.org/v1/plot-0.16.0",
          "issue": "76",
          "commit": "3b95b14"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.68.3 to 0.68.4",
          "commit": "82c04e0"
        },
        {
          "description": "bump gonum.org/v1/plot from 0.15.2 to 0.16.0",
          "commit": "79a380f"
        },
        {
          "description": "bump golangci/golangci-lint-action from 6 to 7",
          "commit": "f711c99"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "52f376e"
        },
        {
          "description": "`charts/d3`: fix various",
          "commit": "c0e5c52"
        },
        {
          "description": "`charts/rickshaw`: fix various",
          "commit": "3af62ca"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "7a78246"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "7521bc0"
        },
        {
          "description": "go mod: update",
          "commit": "0c99f46"
        },
        {
          "description": "`golangci-lint`: disable `staticcheck` `QF1008`",
          "commit": "d124944"
        },
        {
          "description": "`golangci-lint`: update to v2, action v7",
          "commit": "732cb66"
        }
      ]
    },
    {
      "version": "v2.22.6",
      "date": "2025-03-23",
      "internal": [
        {
          "description": "go mod: update",
          "commit": "6962118"
        }
      ]
    },
    {
      "version": "v2.22.5",
      "date": "2025-03-22",
      "added": [
        {
          "description": "`data/table/tabulator`: add constants",
          "commit": "52bee7e"
        }
      ],
      "internal": [
        {
          "description": "`data/table`: fix various",
          "commit": "e7e7b54"
        }
      ]
    },
    {
      "version": "v2.22.4",
      "date": "2025-03-22",
      "dependencies": [
        {
          "description": "Merge pull request #74 from grokify/dependabot/go_modules/gonum.org/v1/plot-0.15.2",
          "issue": "74",
          "commit": "b8fbca0"
        },
        {
          "description": "Merge pull request #73 from grokify/dependabot/go_modules/github.com/go-echarts/go-echarts/v2-2.5.2",
          "issue": "73",
          "commit": "1d8923d"
        }
      ],
      "documentation": [
        {
          "description": "`README.md`: remove inaccurate badge",
          "commit": "5d8428d"
        }
      ],
      "build": [
        {
          "description": "bump gonum.org/v1/plot from 0.15.1 to 0.15.2",
          "commit": "3c7b6ea"
        },
        {
          "description": "bump github.com/go-echarts/go-echarts/v2",
          "commit": "7e77230"
        }
      ],
      "infrastructure": [
        {
          "description": "`ci`: rename",
          "commit": "bb68672"
        },
        {
          "description": "`ci`: rename",
          "commit": "4f9b609"
        }
      ],
      "internal": [
        {
          "description": "`data/tablef64`: update various",
          "commit": "1a99530"
        },
        {
          "description": "`data`: fix various",
          "commit": "b24afb7"
        },
        {
          "description": "go mod: update",
          "commit": "8f82c35"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "5589896"
        },
        {
          "description": "ci: disable `--max-same-issues`",
          "commit": "c8cd95f"
        },
        {
          "description": "`data/timeseries`: fix various",
          "commit": "68f6ff8"
        },
        {
          "description": "go mod: update",
          "commit": "ec27225"
        }
      ]
    },
    {
      "version": "v2.22.3",
      "date": "2025-03-10",
      "documentation": [
        {
          "description": "`README.md`: update GitHub action badge link for branch",
          "commit": "24f7dd5"
        }
      ],
      "internal": [
        {
          "description": "`data/table`: fix various",
          "commit": "9fa2bf2"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "e66a7df"
        },
        {
          "description": "`data/histogram`: fix various",
          "commit": "0d21e34"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "e420db8"
        },
        {
          "description": "golangci-lint: add --max-issues-per-linter`; update `--max-same-issues`",
          "commit": "de5e2be"
        },
        {
          "description": "`golangci-lint`: add arg `--max-same-issues`",
          "commit": "dc6591d"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "5f85e5c"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "462abde"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "96aa899"
        },
        {
          "description": "`data/timeseries`: fix various",
          "commit": "00f8d87"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "8c9b918"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "9bbd62a"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "f23b43e"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "fdc42a1"
        },
        {
          "description": "`data/bullet`: fix various",
          "commit": "dd2b008"
        },
        {
          "description": "`data/table`: fix various",
          "commit": "4afebfb"
        },
        {
          "description": "go mod: update",
          "commit": "0156dfa"
        },
        {
          "description": "go mod: update",
          "commit": "f406a29"
        }
      ]
    },
    {
      "version": "v2.22.2",
      "date": "2025-02-23",
      "added": [
        {
          "description": "`data/histogram`: add `Histogram.Percentile()`",
          "commit": "8c87b55"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "1eb5272"
        },
        {
          "description": "go mod: update",
          "commit": "73144e8"
        }
      ]
    },
    {
      "version": "v2.22.1",
      "date": "2025-02-16",
      "added": [
        {
          "description": "`data/table`: add `Table.FormatterFuncHTML()`",
          "commit": "b84fceb"
        },
        {
          "description": "`charts/google`: add `ChartsLoaderJS`",
          "commit": "2dbaab4"
        },
        {
          "description": "`charts/google/piechart`: add `PieChartMaterialHTML()` support for rendering partial HTML",
          "commit": "4764f23"
        }
      ],
      "internal": [
        {
          "description": "deps: update go versions",
          "commit": "2ea992e"
        },
        {
          "description": "go mod: update",
          "commit": "348785a"
        },
        {
          "description": "deps: update go versions",
          "commit": "6e22ae6"
        }
      ]
    },
    {
      "version": "v2.22.0",
      "date": "2025-02-09",
      "added": [
        {
          "description": "`charts/echarts`: add `NewBarHistogramSet()`, `HistogramSetBarSeriesSlice()`, `HistogramBarSeries()`",
          "commit": "70c934d"
        },
        {
          "description": "`data/histogram`: add `HistogramSet.Order`",
          "commit": "d39f449"
        },
        {
          "description": "`data/histogram`: add `Histogram.BinValuesOrDefault()`",
          "commit": "67d75d5"
        },
        {
          "description": "`data/table`: add `Columns.MustCellIntOrDefault()`, `Columns.MustCellTime()`",
          "commit": "70b93a9"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #72 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.67.7",
          "issue": "72",
          "commit": "daebc2e"
        },
        {
          "description": "Merge pull request #71 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.67.6",
          "issue": "71",
          "commit": "4797e25"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.67.6 to 0.67.7",
          "commit": "c0b0323"
        },
        {
          "description": "bump github.com/grokify/mogo from 0.67.5 to 0.67.6",
          "commit": "18cc3e1"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "818c57d"
        }
      ]
    },
    {
      "version": "v2.21.12",
      "date": "2025-01-13",
      "added": [
        {
          "description": "`data/table`: add `Columns.Unique()`",
          "commit": "e24fae8"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "46d80ff"
        }
      ]
    },
    {
      "version": "v2.21.11",
      "date": "2025-01-12",
      "dependencies": [
        {
          "description": "Merge pull request #70 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.67.2",
          "issue": "70",
          "commit": "b638a25"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.67.1 to 0.67.2",
          "commit": "bef4031"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "9e36897"
        }
      ]
    },
    {
      "version": "v2.21.10",
      "date": "2025-01-07",
      "changed": [
        {
          "description": "chore(license); update years",
          "commit": "c90a8e7"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "7cd9f60"
        }
      ]
    },
    {
      "version": "v2.21.9",
      "date": "2025-01-02",
      "added": [
        {
          "description": "`data/histogram`: add `ReadFileHistogramBins()`",
          "commit": "9c9db4e"
        }
      ],
      "fixed": [
        {
          "description": "`data/histogram`: update `ReadFileHistogramBins()`",
          "commit": "03fa2b5"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "bee9907"
        }
      ]
    },
    {
      "version": "v2.21.8",
      "date": "2024-12-30",
      "internal": [
        {
          "description": "go mod: update",
          "commit": "4aef832"
        }
      ]
    },
    {
      "version": "v2.21.7",
      "date": "2024-12-26",
      "added": [
        {
          "description": "`data/table`: add `Table.AddColumnLineNumber()`",
          "commit": "857423a"
        }
      ],
      "changed": [
        {
          "description": "`data/table`: move `Table.AddColumnLineNumber()` to inplace editing for performance",
          "commit": "f76ca1c"
        }
      ],
      "fixed": [
        {
          "description": "`data/table`: update `Table.Clone()`",
          "commit": "2bc9787"
        }
      ]
    },
    {
      "version": "v2.21.6",
      "date": "2024-12-25",
      "added": [
        {
          "description": "`data/table`: add `TableSet.LensOrdered()`",
          "commit": "e98784d"
        }
      ]
    },
    {
      "version": "v2.21.5",
      "date": "2024-12-24",
      "added": [
        {
          "description": "`data/histogram`: add `Histogram.ItemValuesOrdered()`",
          "commit": "bbe5f73"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "c6f7099"
        }
      ]
    },
    {
      "version": "v2.21.4",
      "date": "2024-12-24",
      "dependencies": [
        {
          "description": "Merge pull request #69 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.66.4",
          "issue": "69",
          "commit": "fea7ba6"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.66.3 to 0.66.4",
          "commit": "43d1252"
        }
      ]
    },
    {
      "version": "v2.21.3",
      "date": "2024-12-22",
      "internal": [
        {
          "description": "go mod: update",
          "commit": "c37bcb4"
        }
      ]
    },
    {
      "version": "v2.21.2",
      "date": "2024-12-15",
      "changed": [
        {
          "description": "`data/table`: add `ColumnDefinitions{}`; rename `ColumnDefinitionSet{}`",
          "commit": "6a63ab0"
        },
        {
          "description": "go mod: update",
          "commit": "8404389"
        },
        {
          "description": "go mod: update",
          "commit": "3550b38"
        },
        {
          "description": "go mod: update",
          "commit": "4ac9e0f"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #68 from grokify/dependabot/go_modules/golang.org/x/crypto-0.31.0",
          "issue": "68",
          "commit": "7099f99"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/crypto from 0.30.0 to 0.31.0",
          "commit": "cf7dc58"
        }
      ]
    },
    {
      "version": "v2.21.1",
      "date": "2024-12-02",
      "changed": [
        {
          "description": "go mod: update",
          "commit": "5cff95d"
        },
        {
          "description": "`data/table`: simplify code",
          "commit": "bb1b193"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #67 from grokify/dependabot/go_modules/github.com/grokify/mogo-0.65.7",
          "issue": "67",
          "commit": "943fd3a"
        }
      ],
      "build": [
        {
          "description": "bump github.com/grokify/mogo from 0.65.5 to 0.65.7",
          "commit": "ec46888"
        }
      ]
    },
    {
      "version": "v2.21.0",
      "date": "2024-11-20"
    },
    {
      "version": "v2.20.7",
      "date": "2024-11-20",
      "added": [
        {
          "description": "`data/table`: add `Table.Clone()`",
          "commit": "2fb8756"
        }
      ],
      "changed": [
        {
          "description": "`data/table`: update error handling for `Table.FilterColumnDistinctFirstTable()`, `Table.FilterColumnValuesTable()`",
          "commit": "7f8b29a"
        }
      ],
      "fixed": [
        {
          "description": "`data/table`: fix #65 by removing functions from JSON for marshaling",
          "issue": "65",
          "commit": "fa03852"
        }
      ]
    },
    {
      "version": "v2.20.6",
      "date": "2024-11-20",
      "added": [
        {
          "description": "`data/table`: add `ReadFileJSON()`, `Table.WriteJSONObjects()`",
          "commit": "9b656b5"
        }
      ],
      "changed": [
        {
          "description": "go mod: update",
          "commit": "56a9b7d"
        },
        {
          "description": "go mod: update",
          "commit": "93c5ede"
        }
      ]
    },
    {
      "version": "v2.20.5",
      "date": "2024-11-10",
